conskurra/app/views/maps/index.html.erb


   var latlong = $('.map').data('marker');
---
SELECT "maps".* FROM "maps"