conskurra/app/controllers/maps_controller.rb

SELECT "maps".* FROM "maps"
---
  def index
    @maps = Map.all

INSERT INTO "maps" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 26 Jan 2014 04:20:42 UTC +00:00], ["name", "google maps"], ["updated_at", Sun, 26 Jan 2014 04:20:42 UTC +00:00]]
---
  def create
    @map = Map.new(map_params)

    respond_to do |format|
      if @map.save

SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_map
      @map = Map.find(params[:id])